
gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x823: file p2final.c, line 28.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:28
28  {
(gdb) n
30  input( &a , &b , &c );
(gdb) n
enter the first number: n
31  cmp(a ,b ,c ,&large);
(gdb) n
32  output(large);
(gdb) n
enter the second number: enter the thrid number: the largest number is: 32767
33  return 0;
(gdb) n
34  }(gdb) n
__libc_start_main (main=0x56036520081b <main>, argc=1, 
    argv=0x7fff7cbc6ca8, init=<optimized out>, fini=<optimized out>, 
    rtld_fini=<optimized out>, stack_end=0x7fff7cbc6c98)
    at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) s
__GI_exit (status=0) at exit.c:139
139 exit.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 77) exited normally]
(gdb) l
134 in exit.c
(gdb) quit
